#include <iostream>

/*
  0. Рендер
    - Линии толщиной "1 шмиксель"
    - Линии могут иметь толщину
    - Сглаживание
  1. Создавать разные фигуры
    - Пример: отрезок
      - с координатами
      - отрезок между другими фигурами
    - Пример: окружность
      - Соосные окружности
      - Касательная окружности
  2. Камера: отображать разные части СК
    - Камера по умолчанию
    - Камера в заданной позиции
    - Камера, привязанная к фигуре
    - Создать/удалить/добавить
    - Объединение камер
  3. Операции с фигурами
    - Подвинуть "на"
    - Переместить "в"
    - Поворот
    - Рисование кривых/косых линий
    - Комбинация фигур
    - Слои и разные символы для отрисовки разных слоев
    - Операции со слоями (пересечение/вычитание/объединение)
  4. Сохранить/загрузить "рабочую область"
    - Открыть
    - Закрыть
    - Удалить
    - Состояние проекта
  5. Мета-команды
    - Хелп/описание
    - Макрос (без параметров)
    - Макросы с параметрами
    - Макросы с именованными параметрами
    - Чтение команд из файла
    - Сохранение макросов/загрузка макросов
  6. Придумать что-нибудь свое
  7. Цветные глифы/фон
  8. Экспорт в .png
  9. Экспорт в .svg/импорт из .svg
  10. Отрисовка текста разного размера
*/

int main()
{
}
